{
  "url": "https://www.leafly.com/strains/caffeine",
  "name": "Caffeine",
  "awards": [],
  "effects": [
    "Energetic",
    "Focused",
    "Creative"
  ],
  "flavors": [
    "Earthy",
    "Citrus",
    "Pine"
  ],
  "lineage": [
    "Northern Lights",
    "Columbian Gold"
  ],
  "medical": [
    "Insomnia",
    "Stress",
    "Arthritis"
  ],
  "terpenes": [
    "Limonene",
    "Caryophyllene",
    "Myrcene"
  ],
  "grow_info": {
    "yield": "medium",
    "height": "medium",
    "difficulty": "moderate",
    "flowering_time_weeks": null
  },
  "cbd_percent": null,
  "description": "Caffeine is a sativa-dominant hybrid weed strain made from a genetic cross between Northern Lights and Columbian Gold. This strain showcases a genetic composition that is approximately 70% sativa and 30% indica, resulting in a stimulating and uplifting cannabis experience. With a THC content that typically ranges between 15% and 20%, this strain can cater to both beginners and experienced cannabis consumers who desire a moderate to moderately high potency. Leafly customers tell us the effects of Caffeine include an initial burst of energy and heightened focus. This often transitions into a feeling of euphoria and uplifted mood, making Caffeine an ideal choice for daytime activities and productivity. The sativa-dominant nature of the strain contributes to its invigorating effects, which can help combat fatigue and promote a sense of mental clarity. Medical marijuana patients often turn to Caffeine for relief from symptoms associated with conditions such as depression, anxiety, and lack of focus. The strain's mood-enhancing effects, combined with its potential to increase alertness and motivation, can provide a sense of mental relief and vitality. Additionally, Caffeine's potential to reduce stress and promote a positive outlook on the day can be particularly beneficial for managing mood-related challenges. Caffeine features a flavor profile that combines elements of its parent strains. Users often describe a mix of earthy and herbal flavors with hints of citrus and pine. This complex flavor experience adds to the overall enjoyment of consuming Caffeine. The dominant terpene found in Caffeine is limonene, contributing to its potential mood-enhancing effects and citrusy aroma. The average price of Caffeine can vary depending on location and dispensary, but it typically falls within the mid to higher price range. Caffeine's energizing effects and potential therapeutic benefits have positioned it as a notable sativa-dominant hybrid strain in the cannabis community.",
  "thc_percent": 19,
  "rating_count": 8,
  "average_rating": 3.9,
  "classification": "Hybrid"
}