{
  "url": "https://www.leafly.com/strains/death-star",
  "name": "Death Star",
  "awards": [],
  "effects": [
    "sleepy",
    "relaxed",
    "tingly"
  ],
  "flavors": [
    "diesel",
    "pungent",
    "tea"
  ],
  "lineage": [
    "Sensi Star",
    "Sour Diesel"
  ],
  "medical": [
    "stress",
    "pain",
    "anxiety"
  ],
  "terpenes": [
    "caryophyllene",
    "myrcene",
    "limonene"
  ],
  "grow_info": {
    "yield": "medium",
    "height": "medium",
    "difficulty": "moderate",
    "flowering_time_weeks": "7 - 9"
  },
  "cbd_percent": 0,
  "description": "Death Star is an indica weed strain made from a genetic cross between Sensi Star and Sour Diesel. This strain is named for its skunky sweet jet fuel aromas that are pungent and fill up your nostrils. This strain may not have the ability to destroy planets, but it does have a powerful buzz that can make you feel sleepy, relaxed, and euphoric. Death Star is 19% THC, making this strain an ideal choice for experienced cannabis consumers. Leafly customers tell us Death Star effects include feeling sleepy, relaxed, and euphoric. Medical marijuana patients often choose Death Star when dealing with symptoms associated with stress, pain, and anxiety. Bred by unknown breeders, Death Star features flavors like diesel, pungent, and tea. The dominant terpene of this strain is unknown. The average price of Death Star typically ranges from $10-$15 per gram. This strain has a frosty appearance with purple shades of color visible in its stems. Death Star also has a connection to the Star Wars franchise, as it refers to the massive space station that can obliterate entire planets with its superlaser. Some fans of Star Wars may enjoy this strain as a way to feel the power of the dark side or rebel against the Empire. Red Squadron may have destroyed the empire's battle station during the battle of Yavin, but luckily this strain survived the explosion.",
  "thc_percent": 19,
  "rating_count": 1503,
  "average_rating": 4.5,
  "classification": "Indica"
}