{
  "url": "https://www.leafly.com/strains/gelato",
  "name": "Gelato",
  "awards": [],
  "effects": [
    "Relaxed",
    "Aroused",
    "Euphoric"
  ],
  "flavors": [
    "Sweet",
    "Flowery",
    "Pepper"
  ],
  "lineage": [
    "Sunset Sherbet",
    "Thin Mint Girl Scout Cookies"
  ],
  "medical": [
    "Anxiety",
    "Stress",
    "Depression"
  ],
  "terpenes": [
    "Caryophyllene",
    "Limonene",
    "Humulene"
  ],
  "grow_info": {
    "yield": "medium",
    "height": "short to medium",
    "difficulty": "difficult",
    "flowering_time_weeks": 8
  },
  "cbd_percent": 0,
  "description": "Gelato, also known as \"Larry Bird\" and \"Gelato #42\" is an evenly-balanced hybrid marijuana strain made from a crossing of Sunset Sherbet and Thin Mint Girl Scout Cookies. With its balance of indica & sativa, this strain produces a euphoric high accompanied by strong feelings of relaxation. Consumers who have smoked Gelato say the effects of the strain come on quickly. You'll be left feeling numb to pain, relaxed, but mentally stimulated and productive. As far as potency goes, Gelato boasts a THC level of 21%, making it an ideal choice for medical marijuana patients seeking relief for pain, fatigue, and insomnia. Novice consumers may want to approach this THC powerhouse with caution, but those armed with a high THC tolerance will delight in the heavy-handed effects this strain offers. In terms of taste, Gelato is sweet and features fruity and creamy flavors and aromas. According to growers, this strain produces buds that bloom in dark purple hues and are illuminated by fiery orange hairs and a shiny white coating of crystal resin. The average price per gram of Gelato is $12. Because Gelato has reached a legendary status among cannabis connoisseurs, it comes as no surprise it's been used to make a variety of other high-quality Gelato strains, including Gelato #3, Gelato #33, Gelato #41, and Gelato #45.",
  "thc_percent": 21,
  "rating_count": 2499,
  "average_rating": 4.6,
  "classification": "Hybrid"
}