{
  "url": "https://www.leafly.com/strains/motorbreath-15",
  "name": "Motorbreath 15",
  "awards": [],
  "effects": [
    "relaxed",
    "happy",
    "euphoric"
  ],
  "flavors": [
    "diesel",
    "chemical",
    "pepper",
    "earthy",
    "citrus"
  ],
  "lineage": [
    "Chemdog",
    "SFV OG Kush"
  ],
  "medical": [
    "anxiety",
    "pain",
    "stress"
  ],
  "terpenes": [
    "myrcene",
    "limonene",
    "caryophyllene"
  ],
  "grow_info": {
    "yield": "medium",
    "height": "medium",
    "difficulty": "moderate",
    "flowering_time_weeks": null
  },
  "cbd_percent": null,
  "description": "Motorbreath 15 is an indica-dominant hybrid weed strain made from a genetic cross between Chemdog and SFV OG Kush. This strain is 70% indica and 30% sativa. Motorbreath 15 has a rare and exotic lineage, as it is the only strain cultivated by Jimmy Nitz of Pisces Genetics. Motorbreath 15 is 18-22% THC, making this strain an ideal choice for experienced cannabis consumers who can handle a potent high. Leafly customers tell us Motorbreath 15 effects include feeling relaxed, happy, and euphoric. Medical marijuana patients often choose Motorbreath 15 when dealing with symptoms associated with stress, insomnia, and pain. Bred by Pisces Genetics, Motorbreath 15 features flavors like diesel, chemical, and pepper. The dominant terpene of this strain is myrcene, which contributes to its sedating and anti-inflammatory properties. The average price of Motorbreath 15 typically ranges from $10-$15 per gram. Motorbreath 15 is a potent and flavorful strain that has a gassy and earthy aroma and flavor, with hints of citrus and spice. It has a balanced high that is both relaxing and euphoric, with a pleasant body buzz and a creative mind. Motorbreath 15 is a rare and exclusive strain that is not widely available, so if you find it at your local dispensary, don’t hesitate to try it out.",
  "thc_percent": 26,
  "rating_count": 19,
  "average_rating": 4.2,
  "classification": "Hybrid"
}