{
  "url": "https://www.leafly.com/strains/purple-milk",
  "name": "Purple Milk",
  "awards": [],
  "effects": [
    "Hungry",
    "Focused",
    "Relaxed"
  ],
  "flavors": [
    "Vanilla",
    "Grape",
    "Berry"
  ],
  "lineage": [
    "Bubba Kush",
    "Purple OG Kush"
  ],
  "medical": [
    "Anxiety",
    "Pain",
    "Headaches"
  ],
  "terpenes": [
    "Caryophyllene",
    "Humulene",
    "Linalool"
  ],
  "grow_info": {
    "yield": "medium",
    "height": "medium",
    "difficulty": "moderate",
    "flowering_time_weeks": null
  },
  "cbd_percent": 0,
  "description": "Purple Milk is a hybrid weed strain made from a genetic cross between Purple OG Kush and Bubba Kush. This strain is 60% sativa and 40% indica. Known for its striking appearance and balanced effects, Purple Milk is a popular choice among cannabis enthusiasts. With a THC content of around 18-22%, Purple Milk offers a well-rounded experience suitable for both beginners and experienced cannabis consumers. The effects of Purple Milk include a relaxed and euphoric sensation, followed by a sense of happiness and upliftment. Users often report feeling creatively inspired while enjoying this strain. Medical marijuana patients frequently turn to Purple Milk to alleviate symptoms associated with stress, anxiety, and mild pain. The calming and mood-enhancing properties of this strain make it a preferred option for those seeking relief from daily challenges. Bred by an artisanal breeder, Purple Milk boasts flavors reminiscent of sweet berries, earthy undertones, and a hint of citrus. These delightful flavors contribute to the overall enjoyable experience of consuming this strain. The dominant terpene in Purple Milk is myrcene, which contributes to its relaxing effects and earthy aroma. This terpene is known for its potential anti-inflammatory and analgesic properties, adding to the strain's potential therapeutic benefits.",
  "thc_percent": 13,
  "rating_count": 23,
  "average_rating": 4.3,
  "classification": "Hybrid"
}