{
  "url": "https://www.leafly.com/strains/san-fernando-valley-cookies",
  "name": "San Fernando Valley Cookies",
  "awards": [],
  "effects": [
    "relaxed",
    "happy",
    "euphoric",
    "talkative",
    "uplifted"
  ],
  "flavors": [
    "sweet",
    "citrus",
    "earthy",
    "pine",
    "nutty",
    "vanilla"
  ],
  "lineage": [
    "San Fernando Valley OG Kush",
    "Girl Scout Cookies"
  ],
  "medical": [
    "depression",
    "stress",
    "fatigue"
  ],
  "terpenes": [
    "myrcene",
    "caryophyllene",
    "limonene"
  ],
  "grow_info": {
    "yield": "medium",
    "height": "medium",
    "difficulty": "moderate",
    "flowering_time_weeks": null
  },
  "cbd_percent": null,
  "description": "San Fernando Valley Cookies is a hybrid weed strain made from a genetic cross between San Fernando Valley OG Kush and Girl Scout Cookies. This strain is 60% sativa and 40% indica. With its prestigious lineage, San Fernando Valley Cookies combines the best of both worlds to create a captivating cannabis experience. San Fernando Valley Cookies features a THC content that typically ranges between 18% and 24%, making it an ideal choice for both beginners and experienced cannabis consumers. Leafly customers report that San Fernando Valley Cookies' effects include feeling relaxed, happy, and euphoric. This strain is known for its ability to provide a sense of calm while inducing a blissful and uplifting mood. Medical marijuana patients often turn to San Fernando Valley Cookies when dealing with symptoms associated with stress, depression, and chronic pain. Its balanced effects offer relief without being overly sedating. Bred by Cali Connection, San Fernando Valley Cookies features flavors like sweet, citrus, earthy, pine, and a touch of herbal spiciness. The dominant terpene of this strain is caryophyllene, contributing to its potential for relaxation and mood enhancement. Whether you're seeking a way to unwind and boost your spirits or looking for a strain that can provide gentle relief, San Fernando Valley Cookies delivers a well-rounded and enjoyable experience.",
  "thc_percent": 21,
  "rating_count": 9,
  "average_rating": 4.6,
  "classification": "Hybrid"
}